{
  "title" : "Authorities find 32 kg of fentanyl nestled between nopal leaves in Sonora",
  "image" : [ {
    "imageName" : "a9feb825-bace-406c-8139-6e8965234634.png"
  } ],
  "date" : "05/03/2025",
  "content" : "The suspect was arrested at a vehicle inspection post in the municipality of Huatabampo, Sonora. (@lopezdoriga/X)\n\n Share\n\nMexican authorities have arrested a 29-year-old man in the northern border state of Sonora for transporting more than a quarter million fentanyl pills hidden in a shipment of nopales, or cactus leaves, officials said Wednesday.\n\n\n\nIn addition to 30 black packages containing approximately 275,000 fentanyl pills, authorities said they found two white packages of fentanyl powder. The combined weight of the pills and powder was 32 kilograms, they reported.\n\n\n\nEn Sonora fuerzas federales detuvieron a un hombre que transportaba 32 kilos de fentanilo ocultos en un cargamento de nopales en un tráiler.\n\n\n\nMás en https://t.co/BjdELZkX5p pic.twitter.com/v3nDlUlGXZ\n\n\n\n— Joaquín López-Dóriga (@lopezdoriga) March 5, 2025\n\n\n\nAccording to the Security and Citizen Protection Ministry (SSPC), the street value of the drugs is 131.3 million pesos (US $6.44 million).\n\n\n\nThe suspect was arrested at a vehicle inspection post in the municipality of Huatabampo, Sonora, on the federal highway heading north between Los Mochis, Sinaloa, and Navojoa, Sonora — approximately 600 kilometers south of Nogales, Sonora, at the Mexico-U.S. border.\n\n\n\nThe suspect’s white tractor-trailer was transporting boxes of nopales, inside which the pills and powder were hidden, authorities said. The Spanish word nopales is also used in English, especially in culinary and agricultural contexts, to refer to the edible pads of a prickly pear cactus.\n\n\n\nThe seizure came amid heightened tensions between Mexico and the United States over fentanyl trafficking. The synthetic opioid, a major business for the cartels based in Sinaloa and Jalisco, is often smuggled into the U.S. hidden in buses, parcel shipments and even drones.\n\n\n\nA press release noted that the arrest occurred “within the framework of the National Security Strategy and as a result of coordinated work” among the following agencies: the SSPC, the federal prosecutor’s Criminal Investigation Agency (AIC), National Defense (Sedena), the Navy Ministry (Semar) and the National Guard (GN).\n\n\n\nThe arrest coincided with the recent implementation of 25% tariffs on Mexican exports by U.S. President Donald Trump, aimed at pressuring Mexico to combat drug trafficking, especially fentanyl.\n\n\n\n“With these actions, the institutions of the Security Cabinet reaffirm their commitment to work in a coordinated manner to build peace and prevent drugs from reaching young people,” the SSPC stated in a press release.\n\n\n\nEarlier this week, Mexican authorities reported that, since launching Operación Frontera Norte (Operation Northern Border) on Feb. 5, approximately 18,690 kilograms (18.7 tonnes) of illegal drugs — including nearly 56 kilograms of fentanyl — had been seized and more than 1,000 suspected drug traffickers arrested.\n\nFentanyl found in crates of nopales\n\nAlso within the past two weeks, the Mexican Navy reported seizing some 2 tonnes of suspected cocaine from a boat off the Pacific coast of Chiapas and Mexican President Claudia Sheinbaum approved the transfer of 29 top drug lords to face trial in the United States.\n\n\n\nWith reports from El Universal, Associated Press and López-Dóriga Digital"
}